As the error says the policy already exists, GCP must creates all org policies at the org level during creation, and the provider doesn't just pull that into state when the module is created. Which makes sense from how terraform often works but is pretty broken in this case.

As a (rather frustrating) stop-gap to this issue. One can import the `google_org_policy_policy` that the `org_policy_v2` submodule creates. Terraform then destroys and recreates at which point the policy is managed under state. 

Extra annoying I'm on tf 1.5 so can't use dynamic values in the import block so I need to harcode the organization id. 

```hcl
module "disable_service_account_key_creation" {
  source  = "terraform-google-modules/org-policy/google//modules/org_policy_v2"
  version = "~> 5.3.0"
  policy_root      = "organization"                         
  policy_root_id   = var.org_id                             
  constraint       = "iam.disableServiceAccountKeyCreation"
  policy_type      = "boolean"                             
  exclude_folders  = []
  exclude_projects = []

  rules = [
    {
      enforcement = true
      allow       = []
      deny        = []
      conditions  = []
    },
  ]
}

import {
  id = "organizations/<org-id>/policies/iam.disableServiceAccountKeyCreation"
  to = module.disable_service_account_key_creation.google_org_policy_policy.org_policy_boolean[0]
}
```
which then applies the following

```hcl
Terraform will perform the following actions:

  # module.disable_service_account_key_creation.google_org_policy_policy.org_policy_boolean[0] must be replaced
  # (imported from "organizations/<org-id>/policies/iam.disableServiceAccountKeyCreation")
  # Warning: this will destroy the imported resource
-/+ resource "google_org_policy_policy" "org_policy_boolean" {
      ~ id     = "organizations/<org-id>/policies/iam.disableServiceAccountKeyCreation" -> (known after apply)
      ~ name   = "iam.disableServiceAccountKeyCreation" -> "organizations/<org-id>/policies/iam.disableServiceAccountKeyCreation" # forces replacement
        parent = "organizations/<org-id>"

      ~ spec {
          ~ etag                = "<etag>" -> (known after apply)
          - inherit_from_parent = false -> null
          - reset               = false -> null
          ~ update_time         = "2024-03-13T17:55:37.866621Z" -> (known after apply)

            rules {
                enforce = "TRUE"
            }
        }

      - timeouts {}
    }

Plan: 1 to import, 1 to add, 0 to change, 1 to destroy.
```
@ReneCamu @ensonic